In [2]:
import numpy as np
import pandas as pd

In [16]:
data = {'Compony' : ['GOOG', 'GOOG','MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam','Charlie','Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales' : [200, 120, 340, 124, 243, 350],
       }

In [17]:
data

{'Compony': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [18]:
df = pd.DataFrame(data)

In [19]:
df

  Compony   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [20]:
byComp = df.groupby('Compony')

In [21]:
byComp.mean()

         Sales
Compony
FB       296.5
GOOG     160.0
MSFT     232.0

In [22]:
byComp.std()

              Sales
Compony
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [24]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [25]:
df.groupby('Compony').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [26]:
df.groupby('Compony').count()

         Person  Sales
Compony
FB            2      2
GOOG          2      2
MSFT          2      2

In [ ]:
df.ge